CSI API ETABS v1
cCaseModalEigen Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cCaseModalEigen
Public Interface cCaseModalEigen
Dim instance As cCaseModalEigen
public interface class cCaseModalEigen
type cCaseModalEigen =  interface end
The cCaseModalEigen type exposes the following members.
Methods
Name | Description
GetInitialCase
 This function retrieves the initial condition assumed for the specified load case.
GetLoads
 This function retrieves the load data for the specified load case.
GetNumberModes
 This function retrieves the number of modes requested for the specified load case.
GetParameters
 This function retrieves various parameters for the specified load case.
SetCase
 This function initializes a modal Eigen load case. If this function is called for an existing load case, all items for the case are reset to their default value.
SetInitialCase
 This function sets the initial condition for the specified load case.
SetLoads
 This function sets the load data for the specified load case.
SetNumberModes
 This function sets the number of modes requested for the specified load case.
SetParameters
 This function sets various parameters for the specified load case.
Top
See Also
Reference
ETABSv1 Namespace